
#---------------------------------------------------------------------------------------------
# 弾性剛性マトリクスを作成
#---------------------------------------------------------------------------------------------
function make_C0_3D(poisson::Float64)::Matrix{Float64}
    #
    tmp = 1.0 / ((1.0 + poisson) * (1.0 - 2.0 * poisson))
    #
    C0 = zeros(Float64, 6, 6)
    
    C0[1, 1] = 1.0 - poisson
    C0[1, 2] = poisson
    C0[1, 3] = poisson

    C0[2, 1] = poisson
    C0[2, 2] = 1.0 - poisson
    C0[2, 3] = poisson

    C0[3, 1] = poisson
    C0[3, 2] = poisson
    C0[3, 3] = 1.0 - poisson
    
    C0[4, 4] = 0.5 * (1.0 - 2.0 * poisson)
    C0[5, 5] = 0.5 * (1.0 - 2.0 * poisson)
    C0[6, 6] = 0.5 * (1.0 - 2.0 * poisson)

    return tmp * C0 
end
#---------------------------------------------------------------------------------------------
# 弾性剛性マトリクスを作成
#---------------------------------------------------------------------------------------------
function make_C_3D(young::Float64, poisson::Float64)::Matrix{Float64}
    return young * make_C0_3D(poisson)
end
#---------------------------------------------------------------------------------------------
# 弾性剛性マトリクスを作成
#---------------------------------------------------------------------------------------------
function make_C0_plane_strain(poisson::Float64)::Matrix{Float64}
    #
    tmp = 1.0 / ((1.0 + poisson) * (1.0 - 2.0 * poisson))
    #
    C0 = zeros(Float64, 3, 3)
    C0[1, 1] = 1.0 - poisson
    C0[1, 2] = poisson
    C0[2, 1] = poisson
    C0[2, 2] = 1.0 - poisson
    C0[3, 3] = 0.5 * (1.0 - 2.0 * poisson)
    return tmp * C0 
end
#---------------------------------------------------------------------------------------------
# 弾性剛性マトリクスを作成
#---------------------------------------------------------------------------------------------
function make_C_plane_strain(young::Float64, poisson::Float64)::Matrix{Float64}
    return young * make_C0_plane_strain(poisson) 
end
#---------------------------------------------------------------------------------------------
# 弾性剛性マトリクスを作成
#---------------------------------------------------------------------------------------------
function make_C0_plane_stress(poisson::Float64)::Matrix{Float64}
    #
    tmp = 1.0 / (1.0 - poisson * poisson)
    #
    C0 = zeros(Float64, 3, 3)
    C0[1, 1] = 1.0 
    C0[1, 2] = poisson
    C0[2, 1] = poisson
    C0[2, 2] = 1.0
    C0[3, 3] = 0.5 * (1.0 -poisson)
    return tmp * C0 
end
#---------------------------------------------------------------------------------------------
# 弾性剛性マトリクスを作成
#---------------------------------------------------------------------------------------------
function make_C_plane_stress(young::Float64, poisson::Float64)::Matrix{Float64}
    return young * make_C0_plane_stress(poisson) 
end