

#----------------------------------------------------------------------------
#　節点
#----------------------------------------------------------------------------
struct Node
    id::Int64
    coordinate::Vector{Float64}                 # 節点座標
    dof_ids::Vector{Int64}                      # 自由度番号
    #--------------------------------------------------------
    #
    #--------------------------------------------------------
    function Node(id::Int64, coordinate::Vector{Float64})
        return new(id, coordinate, Vector{Int64}())
    end 
end